consciousness-compass/backend/app/controllers/api/v1/resource_links_controller.rb

  def index
    @resource_links = if params[:subsection_id]
                        Subsection.find(params[:subsection_id]).resource_links
---
SELECT "resource_links".* FROM "resource_links" WHERE "resource_links"."subsection_id" = 17
SELECT "sections".* FROM "sections" WHERE "sections"."id" = 4 LIMIT 1
SELECT "subsections".* FROM "subsections" WHERE "subsections"."section_id" = 2