consciousness-compass/backend/app/controllers/api/v1/subsections_controller.rb

SELECT "sections".* FROM "sections" WHERE "sections"."id" = 2 LIMIT 1
SELECT "subsections".* FROM "subsections" WHERE "subsections"."id" = 16 LIMIT 1
SELECT "subsections".* FROM "subsections" WHERE "subsections"."section_id" = 1
---
  def index
    @subsections = if params[:section_id]
                    Section.find(params[:section_id]).subsections
                  else
                    Subsection.all

SELECT "sections".* FROM "sections" WHERE "sections"."id" = 2 LIMIT 1
SELECT "subsections".* FROM "subsections" WHERE "subsections"."id" = 9 LIMIT 1
---
  def show
    @subsection = Subsection.find(params[:id])